Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotConnectDifferentDesignOptsObjects { get; }
  Visual Basic
Public Shared ReadOnly Property CannotConnectDifferentDesignOptsObjects As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotConnectDifferentDesignOptsObjects {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ElectricalFailures Class
  Autodesk.Revit.DB Namespace